/*
## 아래의 내용이 한번에 와닿지 않는다면, Section1. [Js/Node]기초 편 참조
## [ Naming ]
1. 변수명은 값의 본질적인 의미를 가지고 있어야 한다.

2. 변수에 할당되는 값의 형식이 아닌, 그 값의 의미가 변수 이름에 반영되어야 합니다.

3. 데이터의 모음(collection)이 할당된 변수의 이름은 복수 명사가 좋습니다.

4. boolean이 할당된 변수는 is 혹은 are을 붙여서 참 혹은 거짓임을 분명히 표현합니다.

5. 함수의 이름은 동사로 시작하는게 좋습니다.

6. 변수 할당 값이 Class인 경우에 주로 변수의 첫 글자를 대문자로 사용합니다.

7. 상수는 모두 대문자로 적습니다.

8. JavaScript의 문자열 표시를 위해서 작은 따옴표를 권장합니다.

9. 줄 바꿈이 필요한 문자열을 정의할 때는 `(백틱, backtick) 사용을 권장합니다.

10. if, for, while문의 끝에는 세미콜론을 사용하지 않아야 합니다.

11. 함수 표현식의 끝에는 세미콜론을 사용합니다.

12. not 연산자(!)는 바로 앞에 붙여서 사용합니다.(중간에 공백 두지마라)

13. JavaScript에서 snake-case를 사용하는 경우는, 상수 이름을 지을 때입니다.

*/